Revit 2027 API
ParameterTypeId.SweepBaseRoofSubcategoryId Property
 "Subcategory of Roofs"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SweepBaseRoofSubcategoryId { get; }
Public Shared ReadOnly Property SweepBaseRoofSubcategoryId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SweepBaseRoofSubcategoryId {
	ForgeTypeId^ get ();
}
static member SweepBaseRoofSubcategoryId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace